[
    {
        "word": "Furniture",
        "meaning": "n. 家具",
        "sentence": "The new apartment comes unfurnished, allowing residents to choose their preferred furniture."
    },
    {
        "word": "Furnished",
        "meaning": "adj. 家具，有家具的",
        "sentence": "The furnished living room boasted a comfortable sofa, armchair, and a stylish coffee table."
    },
    {
        "word": "Air Conditioner",
        "meaning": "空调",
        "sentence": "As the temperatures soared, the air conditioner provided a welcome relief from the heat."
    },
    {
        "word": "Armchair",
        "meaning": "n. 扶手椅",
        "sentence": "The cozy armchair by the window became the perfect spot for reading and relaxation."
    },
    {
        "word": "Sofa",
        "meaning": "沙发",
        "sentence": "The spacious living room featured a modern and comfortable sofa, ideal for entertaining guests."
    },
    {
        "word": "Cushion",
        "meaning": "n. 垫子；起缓解作用之物",
        "sentence": "Adding a vibrant cushion to the armchair enhanced both comfort and aesthetic appeal."
    },
    {
        "word": "Bed Sheet",
        "meaning": "床单",
        "sentence": "The soft bed sheet complemented the bedroom's decor and ensured a good night's sleep."
    },
    {
        "word": "Blanket",
        "meaning": "n. 毯子",
        "sentence": "On chilly nights, a cozy blanket was essential for staying warm and comfortable."
    },
    {
        "word": "Burglar Alarm",
        "meaning": "防窃报警器；防盗自动警铃",
        "sentence": "The advanced burglar alarm system provided peace of mind for the homeowners."
    },
    {
        "word": "Alarm System",
        "meaning": "报警系统",
        "sentence": "An integrated alarm system with smoke detectors ensured the safety of the entire household."
    },
    {
        "word": "Smoke Alarm",
        "meaning": "烟雾报警器",
        "sentence": "The smoke alarm immediately alerted residents to potential fire hazards, enhancing home safety."
    },
    {
        "word": "Cabinet",
        "meaning": "n. 橱柜",
        "sentence": "The kitchen cabinet was well-organized, providing ample storage space for utensils and cookware."
    },
    {
        "word": "Cable TV",
        "meaning": "有线电视",
        "sentence": "Residents enjoyed a wide range of channels with the convenience of a cable TV subscription."
    },
    {
        "word": "Satellite TV",
        "meaning": "卫星电视",
        "sentence": "Satellite TV offered an extensive selection of international channels and programming."
    },
    {
        "word": "Candle",
        "meaning": "n. 蜡烛；烛光",
        "sentence": "During power outages, the soft glow of candles added a warm and comforting ambiance to the room."
    },
    {
        "word": "Carpet",
        "meaning": "n. 地毯；地毯状覆盖物",
        "sentence": "The luxurious carpet in the living room added a touch of elegance to the interior."
    },
    {
        "word": "Rug",
        "meaning": "n. 小地毯；毛皮地毯",
        "sentence": "A small rug near the entrance prevented dirt from being tracked into the house."
    },
    {
        "word": "Cassette Recorder",
        "meaning": "盒式录音机",
        "sentence": "The vintage cassette recorder allowed residents to enjoy their favorite music in a nostalgic format."
    },
    {
        "word": "Stereo System",
        "meaning": "n. 立体音响系统",
        "sentence": "The state-of-the-art stereo system provided immersive audio experiences for music enthusiasts."
    },
    {
        "word": "Central Heating",
        "meaning": "中央暖气系统；集中采暖",
        "sentence": "The central heating system ensured a comfortable temperature throughout the entire house."
    },
    {
        "word": "Coffee Maker",
        "meaning": "n. 咖啡壶；咖啡机",
        "sentence": "The aroma of freshly brewed coffee filled the kitchen, thanks to the efficient coffee maker."
    },
    {
        "word": "Coffee Table",
        "meaning": "咖啡桌",
        "sentence": "The elegant glass coffee table served as a focal point in the living room."
    },
    {
        "word": "Telephone",
        "meaning": "n. （美）电话",
        "sentence": "The landline telephone on the bedside table provided a reliable means of communication."
    },
    {
        "word": "Cordless Phone",
        "meaning": "无绳电话；室内无线电话",
        "sentence": "The cordless phone allowed residents to move freely while talking without being tethered to a specific location."
    },
    {
        "word": "Landline",
        "meaning": "n. 地上通讯线；输送路线",
        "sentence": "While mobile phones are common, some households still prefer a reliable landline for communication."
    },
    {
        "word": "Mobile Phone",
        "meaning": "手机；行动电话",
        "sentence": "A mobile phone is an essential tool for staying connected in today's fast-paced world."
    },
    {
        "word": "Cupboard",
        "meaning": "n. 碗柜；食橱",
        "sentence": "The cupboard in the kitchen neatly stored dishes, pots, and pans."
    },
    {
        "word": "Cushion",
        "meaning": "n. 垫子",
        "sentence": "Placing a cushion on the dining chair added comfort during long meals."
    },
    {
        "word": "Decoration",
        "meaning": "n. 装饰，装潢",
        "sentence": "Personalized decoration, such as artwork and plants, enhanced the overall atmosphere of the home."
    },
    {
        "word": "Desk Lamp",
        "meaning": "桌灯，台灯",
        "sentence": "A desk lamp with adjustable brightness provided adequate lighting for late-night studying."
    },
    {
        "word": "Drawer",
        "meaning": "n. 抽屉",
        "sentence": "The bedside table had a convenient drawer for storing personal items."
    },
    {
        "word": "Dryer",
        "meaning": "n. 烘干机",
        "sentence": "The modern dryer made laundry chores more efficient and convenient."
    },
    {
        "word": "Electric Fan",
        "meaning": "n. [电] 电扇",
        "sentence": "An electric fan in the bedroom provided relief during hot summer nights."
    },
    {
        "word": "Fireplace",
        "meaning": "n. 壁炉",
        "sentence": "The traditional fireplace added a touch of coziness to the living room."
    },
    {
        "word": "Fridge",
        "meaning": "n. 电冰箱",
        "sentence": "The spacious fridge kept groceries fresh and provided ample storage for food."
    },
    {
        "word": "Freezer",
        "meaning": "n. 冰箱；冷冻库",
        "sentence": "The freezer compartment allowed for long-term storage of frozen foods."
    },
    {
        "word": "House Key",
        "meaning": "房钥匙",
        "sentence": "Losing the house key prompted the need for a spare kept in a secure location."
    },
    {
        "word": "Kettle",
        "meaning": "n. 水壶",
        "sentence": "Boiling water in a kettle is a quick and efficient way to prepare hot beverages."
    },
    {
        "word": "Mattress",
        "meaning": "n. 床垫；褥子",
        "sentence": "A comfortable mattress is essential for a good night's sleep and overall well-being."
    },
    {
        "word": "Microwave Oven",
        "meaning": "n. 微波炉",
        "sentence": "The microwave oven provided a convenient way to heat up leftovers or prepare quick meals."
    },
    {
        "word": "Mirror",
        "meaning": "n. 镜子",
        "sentence": "Placing a mirror strategically in the hallway enhanced the sense of space and light."
    },
    {
        "word": "Pillow",
        "meaning": "n. 枕头",
        "sentence": "Choosing the right pillow is crucial for a comfortable and restful sleep."
    },
    {
        "word": "Pillowcase",
        "meaning": "n. 枕头套",
        "sentence": "The soft cotton pillowcase added a touch of luxury to the bedding."
    },
    {
        "word": "Radiator",
        "meaning": "n. 散热器；暖气片",
        "sentence": "The radiator efficiently distributed warmth throughout the room during the colder months."
    },
    {
        "word": "Heater",
        "meaning": "n. 加热器",
        "sentence": "A portable heater provided additional warmth on particularly chilly days."
    },
    {
        "word": "Shutter",
        "meaning": "n. 百叶窗",
        "sentence": "Wooden shutters on the windows allowed residents to control the amount of natural light entering the room."
    },
    {
        "word": "Sink",
        "meaning": "n. 水槽；洗涤槽",
        "sentence": "A double sink in the kitchen made dishwashing and food preparation more convenient."
    },
    {
        "word": "Dishwasher",
        "meaning": "n. 洗碗工；洗碟机",
        "sentence": "The dishwasher saved time and effort in cleaning up after meals."
    },
    {
        "word": "Tap",
        "meaning": "n. 水龙头",
        "sentence": "A leaky tap in the bathroom required prompt attention to conserve water."
    },
    {
        "word": "Toaster",
        "meaning": "n. 烤面包机",
        "sentence": "The toaster on the kitchen counter facilitated quick and easy breakfast preparation."
    },
    {
        "word": "Tool",
        "meaning": "n. 工具，用具",
        "sentence": "Keeping a toolkit at home is useful for minor repairs and maintenance."
    },
    {
        "word": "Top Shelf",
        "meaning": "高层货架",
        "sentence": "Less frequently used items were stored on the top shelf of the cupboard."
    },
    {
        "word": "Utensil",
        "meaning": "n. 用具，器皿",
        "sentence": "The well-equipped kitchen included a variety of utensils for cooking and baking."
    },
    {
        "word": "Vacuum Cleaner",
        "meaning": "吸尘器",
        "sentence": "Regular use of a vacuum cleaner is essential for maintaining a clean and dust-free home."
    },
    {
        "word": "Hoover",
        "meaning": "n. 电动吸尘器",
        "sentence": "In some regions, the term \"hoover\" is used interchangeably with \"vacuum cleaner.\""
    },
    {
        "word": "Wardrobe",
        "meaning": "n. 衣柜",
        "sentence": "The spacious wardrobe provided ample storage for clothing and accessories."
    },
    {
        "word": "Washbasin",
        "meaning": "n. 脸盆",
        "sentence": "A stylish washbasin in the bathroom added a touch of elegance to the space."
    },
    {
        "word": "Washing Machine",
        "meaning": "洗衣机",
        "sentence": "The washing machine simplified the laundry routine, making it more efficient."
    }
]