[
    {
        "word": "Currency",
        "meaning": "n. 货币；通货",
        "sentence": "When traveling internationally, it's essential to exchange your local currency for the US Dollar or pound sterling, depending on your destination."
    },
    {
        "word": "US Dollar",
        "meaning": "美元",
        "sentence": "The US Dollar is widely accepted as a global reserve currency and is commonly used in international trade."
    },
    {
        "word": "Pound Sterling",
        "meaning": "n. 英镑",
        "sentence": "The pound sterling is the official currency of the United Kingdom and is often used in financial transactions."
    },
    {
        "word": "Debt",
        "meaning": "n. 债务；借款",
        "sentence": "Managing debt wisely is crucial for maintaining a healthy financial situation and credit score."
    },
    {
        "word": "Discount",
        "meaning": "n. 折扣；贴现率",
        "sentence": "Many stores offer discounts during holiday seasons, providing opportunities for cost savings on various purchases."
    },
    {
        "word": "Donation",
        "meaning": "n. 捐款，捐赠物",
        "sentence": "Charitable organizations rely on donations to support their missions and initiatives."
    },
    {
        "word": "Expenditure",
        "meaning": "n. 支出，花费；经费",
        "sentence": "Creating a budget helps individuals track their expenditure and manage their finances effectively."
    },
    {
        "word": "Expense",
        "meaning": "n. 损失，代价",
        "sentence": "Unexpected medical expenses can sometimes lead to financial challenges for individuals and families."
    },
    {
        "word": "Living Expense",
        "meaning": "生活费",
        "sentence": "Rent, utilities, and groceries are examples of essential living expenses that individuals budget for each month."
    },
    {
        "word": "Study Related Expense",
        "meaning": "研究相关的费用",
        "sentence": "Educational expenses, such as tuition and textbooks, are vital considerations for students planning their budgets."
    },
    {
        "word": "Financial",
        "meaning": "adj. 金融的；财政的",
        "sentence": "Financial literacy is the understanding of various financial aspects, including budgeting, investing, and managing debt."
    },
    {
        "word": "Financial Crisis",
        "meaning": "金融危机",
        "sentence": "The 2008 financial crisis had a profound impact on global economies and led to significant changes in financial regulations."
    },
    {
        "word": "Fortune",
        "meaning": "n. 财富",
        "sentence": "Building a fortune often requires careful financial planning, wise investments, and strategic decision-making."
    },
    {
        "word": "Grant",
        "meaning": "n.（政府、机构的）拨款",
        "sentence": "Research projects and academic pursuits often receive grants to support their development and completion."
    },
    {
        "word": "Income",
        "meaning": "n. 收入，收益",
        "sentence": "Diversifying sources of income is a wise financial strategy to enhance overall financial stability."
    },
    {
        "word": "Salary",
        "meaning": "n. 薪水",
        "sentence": "Employees receive a salary as compensation for their work, typically on a monthly or bi-weekly basis."
    },
    {
        "word": "Wage",
        "meaning": "n.（通常指按周领的）工资、工钱",
        "sentence": "Hourly workers receive wages for each hour worked, often paid on a weekly or bi-weekly schedule."
    },
    {
        "word": "Insurance",
        "meaning": "n. 保险；保险费；赔偿金",
        "sentence": "Having insurance coverage, such as health or car insurance, provides financial protection in case of unexpected events."
    },
    {
        "word": "Travel Insurance",
        "meaning": "旅游保险",
        "sentence": "Travel insurance offers coverage for unexpected events during trips, such as trip cancellations or medical emergencies."
    },
    {
        "word": "Invest",
        "meaning": "vt. 投资",
        "sentence": "Investors carefully analyze market trends and potential risks before deciding where to invest their money."
    },
    {
        "word": "Investment",
        "meaning": "n. 投资",
        "sentence": "A well-diversified investment portfolio can help individuals achieve long-term financial goals."
    },
    {
        "word": "Low-Risk Investment",
        "meaning": "低风险投资",
        "sentence": "Government bonds are often considered low-risk investments due to their stable returns."
    },
    {
        "word": "Money",
        "meaning": "n. 钱；货币",
        "sentence": "Money serves as a medium of exchange, facilitating transactions for goods and services."
    },
    {
        "word": "Payment",
        "meaning": "n. 付款，支付",
        "sentence": "Online payment methods have become increasingly popular for their convenience and efficiency."
    },
    {
        "word": "Pension",
        "meaning": "n. 退休金，抚恤金",
        "sentence": "Planning for a pension is crucial to ensure financial security during retirement."
    },
    {
        "word": "Perk",
        "meaning": "n. 小费；额外收入",
        "sentence": "Some jobs offer additional perks, such as healthcare benefits or company discounts."
    },
    {
        "word": "Price",
        "meaning": "n. 价格",
        "sentence": "Consumers compare prices before making purchases to find the best value for their money."
    },
    {
        "word": "Prize",
        "meaning": "n. 奖品；奖赏",
        "sentence": "Winning a prize in a contest or lottery can be an unexpected but welcome financial boost."
    },
    {
        "word": "Refund",
        "meaning": "n. 退款；偿还",
        "sentence": "Unsatisfied customers may request a refund for defective products or services."
    },
    {
        "word": "Savings",
        "meaning": "n. 储蓄；存款",
        "sentence": "Building a habit of regular savings contributes to financial stability and future financial goals."
    },
    {
        "word": "Scholarship",
        "meaning": "n. 奖学金",
        "sentence": "Scholarships provide financial assistance to students based on academic achievements, talents, or other criteria."
    },
    {
        "word": "Stock",
        "meaning": "n. 股份，股票",
        "sentence": "Investing in stocks allows individuals to become partial owners of a company and potentially benefit from its success."
    },
    {
        "word": "Tax",
        "meaning": "n. 税金",
        "sentence": "Understanding the tax implications of various financial decisions is essential for responsible financial planning."
    },
    {
        "word": "Transfer",
        "meaning": "n. 转账；转移",
        "sentence": "Electronic transfers make it convenient for individuals to move money between accounts quickly."
    },
    {
        "word": "Tuition",
        "meaning": "n. 学费",
        "sentence": "Tuition fees vary between educational institutions and are a significant consideration for students and their families."
    },
    {
        "word": "Value",
        "meaning": "n. 值；价值；价格",
        "sentence": "Consumers assess the value of products or services based on their quality and cost."
    },
    {
        "word": "Wealth",
        "meaning": "n. 财富",
        "sentence": "Accumulating wealth involves strategic financial planning and effective investment choices."
    }
]