[
    {
        "word": "Badminton",
        "meaning": "n. 羽毛球",
        "sentence": "Joining the school's badminton team allowed me to improve my skills and compete against other schools."
    },
    {
        "word": "Baseball",
        "meaning": "n. 棒球",
        "sentence": "The baseball match between the two rival teams drew a large crowd of enthusiastic fans."
    },
    {
        "word": "Softball",
        "meaning": "n. 垒球",
        "sentence": "Participating in the annual softball tournament was a highlight of the summer for our community."
    },
    {
        "word": "Volleyball",
        "meaning": "n. 排球",
        "sentence": "As a dedicated volleyball player, I spent countless hours practicing serves and spikes with my teammates."
    },
    {
        "word": "Football",
        "meaning": "n. 足球，橄榄球",
        "sentence": "Playing football not only builds physical strength but also fosters teamwork and strategic thinking."
    },
    {
        "word": "Track and Field",
        "meaning": "田径；田径赛",
        "sentence": "The track and field competition showcased the incredible speed and endurance of the participating athletes."
    },
    {
        "word": "Martial Arts",
        "meaning": "武术",
        "sentence": "Studying martial arts not only teaches self-defense but also instills discipline and respect."
    },
    {
        "word": "Wrestling",
        "meaning": "n. 摔跤；扭斗",
        "sentence": "The intense wrestling match ended with a show of mutual respect between the competitors."
    },
    {
        "word": "Judo",
        "meaning": "n.（日）柔道",
        "sentence": "Judo emphasizes using an opponent's force against them, making it a martial art that requires technique and strategy."
    },
    {
        "word": "Karate",
        "meaning": "n. 空手道",
        "sentence": "Achieving a black belt in karate symbolizes dedication, discipline, and mastery of the art."
    },
    {
        "word": "Boxing",
        "meaning": "n. 拳击",
        "sentence": "The boxing match showcased the skill and agility of the fighters in the ring."
    },
    {
        "word": "Canoe",
        "meaning": "n. 独木舟；赛艇",
        "sentence": "Competing in canoe races requires not only physical strength but also precise coordination with a partner."
    },
    {
        "word": "Hiking",
        "meaning": "n. 徒步旅行",
        "sentence": "Organizing a hiking competition encouraged participants to explore nature while testing their endurance."
    },
    {
        "word": "Hitchhike",
        "meaning": "n. 搭便车",
        "sentence": "The hitchhiking adventure brought together a group of friends on a journey filled with unexpected twists and turns."
    },
    {
        "word": "Surfing",
        "meaning": "n. 冲浪游戏",
        "sentence": "Surfing competitions attract skilled riders who showcase their talent on the waves."
    },
    {
        "word": "Scuba-diving",
        "meaning": "n. 配戴水肺的潜水，深水潜水",
        "sentence": "Exploring the underwater world through scuba-diving competitions requires mastery of diving gear and safety procedures."
    },
    {
        "word": "Diving Gear/Equipment",
        "meaning": "潜水设备",
        "sentence": "The quality of diving gear and equipment is crucial for ensuring a safe and enjoyable diving experience."
    },
    {
        "word": "Snorkeling",
        "meaning": "n. 浮潜；潜水；浅滩潜水",
        "sentence": "Snorkeling competitions highlight participants' ability to explore underwater environments with minimal equipment."
    },
    {
        "word": "Bungee Jumping",
        "meaning": "蹦极跳",
        "sentence": "Overcoming fear and experiencing an adrenaline rush are common reactions during a bungee jumping competition."
    },
    {
        "word": "Rock Climbing",
        "meaning": "攀岩运动",
        "sentence": "Rock climbing tournaments challenge participants to conquer both indoor and outdoor climbing obstacles."
    },
    {
        "word": "Hang Gliding",
        "meaning": "悬挂式滑翔运动",
        "sentence": "The breathtaking views and sense of freedom make hang gliding competitions unforgettable experiences."
    },
    {
        "word": "Parachuting",
        "meaning": "n. [航] 跳伞",
        "sentence": "Parachuting competitions showcase precision and skill as participants navigate the skies before landing."
    },
    {
        "word": "Professional Sports",
        "meaning": "职业体育",
        "sentence": "The world of professional sports is highly competitive, with athletes striving for excellence and recognition."
    },
    {
        "word": "Athlete",
        "meaning": "n. 运动员，体育家",
        "sentence": "An athlete's dedication to training and competition is evident in their pursuit of peak performance."
    },
    {
        "word": "Referee",
        "meaning": "n. 裁判员；调解人",
        "sentence": "The role of a referee is crucial in maintaining fair play and enforcing the rules of the game."
    },
    {
        "word": "Instructor",
        "meaning": "n. 指导书；教员",
        "sentence": "An experienced instructor provides valuable guidance and training to help participants improve their skills."
    },
    {
        "word": "Qualified Instructor",
        "meaning": "授权讲师",
        "sentence": "Seeking guidance from a qualified instructor ensures proper training and reduces the risk of injuries."
    },
    {
        "word": "Coach",
        "meaning": "n. 教练",
        "sentence": "A dedicated coach inspires and motivates athletes to reach their full potential on and off the field."
    },
    {
        "word": "Consultant",
        "meaning": "n. 顾问",
        "sentence": "Sports consultants offer expertise in areas such as strategy, nutrition, and mental preparation for athletes."
    },
    {
        "word": "Chairman",
        "meaning": "n. 主席",
        "sentence": "The chairman of the competition committee plays a key role in organizing and overseeing the event."
    },
    {
        "word": "Cheerleader",
        "meaning": "n. 拉拉队队员",
        "sentence": "Cheerleaders bring energy and enthusiasm to sports competitions, boosting the morale of both athletes and spectators."
    },
    {
        "word": "Competitor",
        "meaning": "n. 竞争者，对手",
        "sentence": "Every competitor in the tournament displayed exceptional skill and sportsmanship."
    },
    {
        "word": "Tournament",
        "meaning": "n. 锦标赛，联赛",
        "sentence": "The annual basketball tournament attracted teams from across the region to compete for the championship."
    },
    {
        "word": "Match",
        "meaning": "n. 比赛，竞赛",
        "sentence": "The intense tennis match went into a tiebreaker, keeping spectators on the edge of their seats."
    },
    {
        "word": "Team",
        "meaning": "n. 队；组",
        "sentence": "A strong sense of camaraderie among team members is crucial for success in team sports."
    },
    {
        "word": "Score",
        "meaning": "n. 分数",
        "sentence": "The final score of the soccer match reflected the skill and determination of both teams."
    },
    {
        "word": "Prize",
        "meaning": "n. 奖品",
        "sentence": "Winning the first-place prize was a testament to the hours of hard work and dedication put into training."
    },
    {
        "word": "Award",
        "meaning": "n. 奖品；判决",
        "sentence": "The award ceremony honored outstanding athletes and their contributions to the competition."
    },
    {
        "word": "Presentation of Award",
        "meaning": "颁奖",
        "sentence": "The presentation of awards concluded the event, acknowledging the achievements of the participants."
    }
]