[
    {
        "word": "Fitness Centre",
        "meaning": "健身中⼼",
        "sentence": "Joining the fitness centre has been instrumental in maintaining a healthy and active lifestyle."
    },
    {
        "word": "Sports Centre",
        "meaning": "体育运动中⼼",
        "sentence": "The state-of-the-art sports centre offers a variety of facilities for athletes and fitness enthusiasts."
    },
    {
        "word": "Sports Articles",
        "meaning": "体育⽤品",
        "sentence": "Equipping oneself with the right sports articles is essential for a safe and enjoyable workout experience."
    },
    {
        "word": "Gym",
        "meaning": "n. 体育馆",
        "sentence": "Working out at the gym provides access to a range of exercise equipment, from weights to cardio machines."
    },
    {
        "word": "Weight Training",
        "meaning": "举重训练",
        "sentence": "Incorporating weight training into the fitness routine helps build strength and endurance."
    },
    {
        "word": "Stretching Exercise",
        "meaning": "伸展运动",
        "sentence": "Regular stretching exercises improve flexibility and reduce the risk of injuries during physical activities."
    },
    {
        "word": "Yoga",
        "meaning": "n. 瑜伽",
        "sentence": "Practicing yoga enhances both physical and mental well-being, promoting flexibility and relaxation."
    },
    {
        "word": "Aerobics",
        "meaning": "n. 有氧运动法；增氧健身法",
        "sentence": "Aerobics classes offer a fun and energetic way to improve cardiovascular fitness."
    },
    {
        "word": "Membership",
        "meaning": "n. 会员",
        "sentence": "Becoming a member of the fitness centre provides access to exclusive classes and facilities."
    },
    {
        "word": "Annual Fee",
        "meaning": "年费",
        "sentence": "Paying the annual fee upfront allows members to enjoy uninterrupted access to the fitness centre."
    },
    {
        "word": "Health Check",
        "meaning": "健康检查",
        "sentence": "A thorough health check is recommended before starting any new fitness program to ensure safety."
    },
    {
        "word": "Assessment",
        "meaning": "n. 评定；估价",
        "sentence": "Fitness assessments help individuals track their progress and set realistic goals."
    },
    {
        "word": "Facilities",
        "meaning": "n. 设备",
        "sentence": "The fitness centre boasts modern facilities, including a well-equipped gym and spacious workout areas."
    },
    {
        "word": "Tennis Court",
        "meaning": "网球场",
        "sentence": "Playing tennis on the well-maintained court is a favorite pastime for many sports enthusiasts."
    },
    {
        "word": "Squash Court",
        "meaning": "壁球场",
        "sentence": "Squash provides an intense and fast-paced workout, making the squash court a popular choice."
    },
    {
        "word": "Basketball Court",
        "meaning": "篮球场",
        "sentence": "Shooting hoops and playing basketball on the court is a great way to stay active and socialize."
    },
    {
        "word": "Football Pitch",
        "meaning": "足球",
        "sentence": "The football pitch is the venue for exciting matches and friendly competitions among friends."
    },
    {
        "word": "Swimming Pool",
        "meaning": "游泳池",
        "sentence": "The sparkling swimming pool offers a refreshing way to exercise and cool down after a workout."
    },
    {
        "word": "Yoga Hall",
        "meaning": "瑜伽会馆",
        "sentence": "The serene yoga hall provides a peaceful space for practitioners to focus on their mind-body connection."
    },
    {
        "word": "Treadmill",
        "meaning": "跑步",
        "sentence": "Running on the treadmill is an effective way to improve cardiovascular fitness in any weather."
    },
    {
        "word": "Activity",
        "meaning": "活动",
        "sentence": "Participating in group activities fosters a sense of community and motivation within the fitness centre."
    },
    {
        "word": "Outdoor Activity",
        "meaning": "室外活动",
        "sentence": "Organizing outdoor activities, such as group hikes or sports events, enhances the fitness centre's sense of community."
    },
    {
        "word": "Special Events",
        "meaning": "特殊事件",
        "sentence": "Special events, like fitness challenges and themed workouts, add excitement to the fitness centre calendar."
    },
    {
        "word": "Tennis",
        "meaning": "网球",
        "sentence": "Playing tennis regularly improves agility, coordination, and cardiovascular fitness."
    },
    {
        "word": "Table Tennis",
        "meaning": "乒乓球",
        "sentence": "Table tennis is a fast-paced and enjoyable sport that can be played by individuals of all skill levels."
    },
    {
        "word": "Cycling",
        "meaning": "自行车运动",
        "sentence": "Cycling, whether indoors or outdoors, is an excellent low-impact exercise for building leg strength and stamina."
    },
    {
        "word": "Jogging",
        "meaning": "慢跑",
        "sentence": "Jogging around the track or park is a popular choice for those looking to improve cardiovascular health."
    },
    {
        "word": "Stadium",
        "meaning": "n. 体育场；露天大型运动场",
        "sentence": "The stadium hosts major sporting events, attracting crowds of enthusiastic fans."
    },
    {
        "word": "Squash",
        "meaning": "壁球",
        "sentence": "Squash is a dynamic sport that demands agility, speed, and strategic thinking on the squash court."
    },
    {
        "word": "Racket",
        "meaning": "球拍",
        "sentence": "Choosing the right racket is crucial for players to maximize their performance in racquet sports."
    },
    {
        "word": "Cricket",
        "meaning": "n. 板球，板球运动",
        "sentence": "Cricket matches on the field bring together players and fans for an exciting day of competition."
    },
    {
        "word": "Rugby",
        "meaning": "n. 板球",
        "sentence": "Rugby is a physically demanding sport known for its intense tackles and strategic gameplay."
    },
    {
        "word": "Golf",
        "meaning": "n. 高尔夫球",
        "sentence": "Golf enthusiasts enjoy the precision and skill required to navigate the course and sink the ball in as few strokes as possible."
    },
    {
        "word": "Bowling",
        "meaning": "n. 保龄球",
        "sentence": "Bowling is a leisurely yet competitive sport that combines skill and camaraderie."
    },
    {
        "word": "Snooker",
        "meaning": "n. 斯诺克台球",
        "sentence": "Playing snooker requires precision and strategic thinking to pot the balls in the correct sequence."
    },
    {
        "word": "Hockey",
        "meaning": "n. 曲棍球",
        "sentence": "Hockey matches showcase teamwork, speed, and precision on the field."
    },
    {
        "word": "Ice Hockey",
        "meaning": "冰球",
        "sentence": "Ice hockey is a fast-paced and exhilarating sport played on an ice rink with skillful skating and goal-scoring."
    },
    {
        "word": "Skiing",
        "meaning": "滑雪",
        "sentence": "Skiing down the slopes is a thrilling winter sport that combines speed and skill."
    },
    {
        "word": "Waterskiing",
        "meaning": "滑水",
        "sentence": "Waterskiing is a water sport that challenges individuals to glide across the water's surface with the pull of a boat."
    },
    {
        "word": "Skating",
        "meaning": "滑冰",
        "sentence": "Skating on ice or rollerblading provides an enjoyable way to improve balance and coordination."
    },
    {
        "word": "Roller Skating",
        "meaning": "滑旱冰",
        "sentence": "Roller skating is a fun and nostalgic activity that can be enjoyed indoors or outdoors."
    }
]