[
    {
        "word": "University",
        "meaning": "n. 大学；综合性大学",
        "sentence": "Attending a prestigious university provides students with a diverse range of academic programs and opportunities for personal growth."
    },
    {
        "word": "College",
        "meaning": "n. 大学；学院",
        "sentence": "Many students choose a college based on its specific strengths in certain academic disciplines or its unique campus culture."
    },
    {
        "word": "Institute",
        "meaning": "n. 学会，协会",
        "sentence": "Research institutes play a crucial role in advancing knowledge and fostering collaboration among academics."
    },
    {
        "word": "Term",
        "meaning": "n. 术语；学期",
        "sentence": "The academic year is divided into terms, each offering a set of courses and assessments."
    },
    {
        "word": "Semester",
        "meaning": "n. 学期；半年",
        "sentence": "The semester system allows for a more focused and immersive learning experience in specific subject areas."
    },
    {
        "word": "Academic",
        "meaning": "adj. 学术的；理论的",
        "sentence": "Academic excellence is often recognized through achievements in research, publications, and contributions to the field."
    },
    {
        "word": "Course Arrangement",
        "meaning": "课程安排",
        "sentence": "The course arrangement for the semester includes a well-balanced mix of core and elective courses."
    },
    {
        "word": "Curriculum",
        "meaning": "n. 课程",
        "sentence": "The curriculum outlines the structure and content of a program of study, ensuring a comprehensive educational experience."
    },
    {
        "word": "Extracurricular",
        "meaning": "adj. 课外的",
        "sentence": "Participating in extracurricular activities enhances students' overall learning experience by fostering teamwork, leadership, and creativity."
    },
    {
        "word": "Timetable",
        "meaning": "n. 时间表；课程表",
        "sentence": "A well-organized timetable ensures that students can effectively manage their study, work, and personal commitments."
    },
    {
        "word": "Textbook",
        "meaning": "n. 教科书，课本",
        "sentence": "Textbooks are essential resources that provide students with the foundational knowledge required for their courses."
    },
    {
        "word": "Handout",
        "meaning": "上课老师发的印刷品",
        "sentence": "The handout distributed by the professor supplements the lecture, offering additional readings, exercises, or key points for further understanding."
    }
]