[
    {
        "word": "Assessment",
        "meaning": "n. 评定；估价",
        "sentence": "The assessment of student performance includes various methods, such as exams, assignments, and class participation."
    },
    {
        "word": "Evaluation",
        "meaning": "n. 评价； [审计] 评估",
        "sentence": "Ongoing evaluation helps educators understand the effectiveness of teaching methods and adapt their approach accordingly."
    },
    {
        "word": "Assignment",
        "meaning": "n. 分配；任务",
        "sentence": "Completing a well-researched assignment is crucial for demonstrating understanding and application of course concepts."
    },
    {
        "word": "Presentation",
        "meaning": "n. 展示；描述，陈述",
        "sentence": "Delivering a clear and engaging presentation is a valuable skill assessed in many academic and professional settings."
    },
    {
        "word": "Essay",
        "meaning": "论说⽂，短评；散⽂，随笔；⽂章",
        "sentence": "Crafting a persuasive and well-structured essay is often a requirement for courses across various disciplines."
    },
    {
        "word": "Journal",
        "meaning": "⽇记；⽇志 , ⽇报，报纸",
        "sentence": "Keeping a reflective journal allows students to document their thoughts, experiences, and insights over time."
    },
    {
        "word": "Ofﬁce Hour",
        "meaning": "上班时间；营业时间",
        "sentence": "Attending office hours provides an opportunity for students to seek clarification on course materials and receive additional guidance."
    },
    {
        "word": "Deadline",
        "meaning": "n. 截⽌期限，最后期限",
        "sentence": "Meeting deadlines for assignments and projects is a key aspect of time management and academic success."
    },
    {
        "word": "Extension",
        "meaning": "延期",
        "sentence": "In certain circumstances, students may request an extension for an assignment deadline due to unforeseen challenges."
    },
    {
        "word": "Participation",
        "meaning": "n. 参与；分享",
        "sentence": "Active class participation contributes to a dynamic learning environment and is often factored into overall assessments."
    },
    {
        "word": "Attendance",
        "meaning": "n. 出席；到场；出席⼈数",
        "sentence": "Regular attendance is essential for staying engaged in lectures, discussions, and practical sessions."
    },
    {
        "word": "Exercise",
        "meaning": "练习",
        "sentence": "Completing exercises reinforces learning and allows students to apply theoretical knowledge to practical problems."
    },
    {
        "word": "Quiz",
        "meaning": "n. 考查；课堂测验",
        "sentence": "Quizzes provide a quick assessment of students' understanding of recent topics and help reinforce key concepts."
    },
    {
        "word": "Final Examination",
        "meaning": "期末考试",
        "sentence": "The final examination evaluates students' comprehensive understanding of the course material."
    },
    {
        "word": "Credit",
        "meaning": "n. 信⽤，信誉；学分",
        "sentence": "Earning course credits is a milestone towards completing academic requirements for a degree."
    },
    {
        "word": "Mark",
        "meaning": "考试的)分数； (品⾏的",
        "sentence": "The mark obtained in assessments reflects a student's performance and understanding of the subject matter."
    },
    {
        "word": "Fail",
        "meaning": "v.（成绩）未通过",
        "sentence": "Failing to meet the required standards in assessments may necessitate additional efforts to grasp the material."
    },
    {
        "word": "Failure Rate",
        "meaning": "不及格率",
        "sentence": "Monitoring the failure rate helps educators identify areas that may need additional support or clarification."
    },
    {
        "word": "Resit",
        "meaning": "n. 补考",
        "sentence": "Students who do not perform well in an exam may have the opportunity to resit the assessment to improve their grade."
    },
    {
        "word": "Cheat",
        "meaning": "n. 作弊",
        "sentence": "Academic integrity is emphasized, and any attempt to cheat in exams or assignments is strictly prohibited."
    },
    {
        "word": "Plagiarism",
        "meaning": "n. 剽窃，抄袭",
        "sentence": "Plagiarism, the act of using someone else's work without proper attribution, is a serious academic offense."
    },
    {
        "word": "Drop-out",
        "meaning": "n.中途退学的⼈",
        "sentence": "Understanding the reasons behind student drop-outs helps institutions implement strategies to support student retention."
    },
    {
        "word": "Exemption",
        "meaning": "免试，免修",
        "sentence": "Some students may be granted exemptions from certain exams or courses based on prior academic achievements."
    },
    {
        "word": "Degree",
        "meaning": "学位",
        "sentence": "Earning a degree is a significant accomplishment and often opens doors to various career opportunities."
    },
    {
        "word": "Diploma",
        "meaning": "学校、学院或⼤学的)学位证书，毕业⽂凭(或证 书",
        "sentence": "A diploma is awarded upon the successful completion of a specific program of study."
    },
    {
        "word": "Certiﬁcation",
        "meaning": "证明书，保证书",
        "sentence": "Certification acknowledges the completion of a specialized course or the attainment of specific skills."
    },
    {
        "word": "Paper",
        "meaning": "n. 论⽂",
        "sentence": "Writing a research paper allows students to delve into a particular topic in depth and develop critical thinking skills."
    },
    {
        "word": "Thesis",
        "meaning": "n. 论⽂；论点",
        "sentence": "The thesis is a comprehensive document presenting original research and is often a requirement for advanced degrees."
    },
    {
        "word": "Dissertation",
        "meaning": "n. 论⽂",
        "sentence": "A dissertation is an extended piece of academic writing, typically required for the completion of a doctoral degree."
    },
    {
        "word": "Debate",
        "meaning": "n. 辩论；辩论会",
        "sentence": "Participating in a debate hones communication and critical thinking skills, allowing students to articulate and defend their perspectives."
    },
    {
        "word": "Defense",
        "meaning": "n. 辩护；辩词；答辩",
        "sentence": "The defense of a thesis or dissertation involves presenting and defending one's research before a committee."
    },
    {
        "word": "Graduation Ceremony",
        "meaning": "n. 毕业典礼",
        "sentence": "The graduation ceremony marks the culmination of academic achievements, celebrating the successful completion of a course of study."
    }
]