[
    {
        "word": "Category",
        "meaning": "n. 种类，分类",
        "sentence": "In the library, books are systematically organized into categories, facilitating efficient exploration and retrieval for patrons seeking specific subjects."
    },
    {
        "word": "Classification",
        "meaning": "n. 分类；类别",
        "sentence": "The classification system employed in the library aids in the orderly arrangement of materials, ensuring a structured and accessible collection for users."
    },
    {
        "word": "Fiction",
        "meaning": "n. 小说；虚构",
        "sentence": "The fiction section of the library is a treasure trove of imaginative literary works, offering novels and stories that transport readers to different realms."
    },
    {
        "word": "Non-Fiction",
        "meaning": "n. 非小说；非小说类文学作品；纪实小说",
        "sentence": "For those seeking factual information, the non-fiction section encompasses a variety of genres, including biographies, history, and informative literature."
    },
    {
        "word": "Reference Book",
        "meaning": "参考书；工具书",
        "sentence": "Reference books, found in a designated section, serve as valuable tools for users looking up specific information, providing concise and reliable facts."
    },
    {
        "word": "Encyclopedia",
        "meaning": "n. 百科全书",
        "sentence": "The library houses encyclopedias, comprehensive references covering a wide range of topics, offering in-depth insights into various subjects."
    },
    {
        "word": "Atlas",
        "meaning": "n. 地图集",
        "sentence": "An atlas, available in the cartography section, provides detailed maps and geographical information, supporting research and exploration."
    },
    {
        "word": "Almanac",
        "meaning": "n. 年鉴；历书",
        "sentence": "The almanac section features annual publications, offering statistical data, weather predictions, and other valuable information for reference."
    },
    {
        "word": "Leaflet",
        "meaning": "n. 传单；⼩册⼦",
        "sentence": "Patrons can find informative leaflets in the library, providing succinct details on events, services, or educational content."
    },
    {
        "word": "Index",
        "meaning": "n. 指标；指数；索引",
        "sentence": "The index is a crucial tool for users navigating through books, journals, and other materials, facilitating quick access to specific information."
    },
    {
        "word": "Front/Back Cover",
        "meaning": "n. 封⾯/封底",
        "sentence": "The front and back covers of books not only protect the content but also serve as visual indicators, offering insights into the book's theme or content."
    },
    {
        "word": "Retrieval",
        "meaning": "n. 检索；恢复",
        "sentence": "Efficient retrieval systems in the library ensure that users can quickly locate and access the materials they need."
    },
    {
        "word": "Reprint",
        "meaning": "n. 重印；翻版",
        "sentence": "Reprints of popular books or articles are available, allowing readers to access well-received content even after its initial publication."
    },
    {
        "word": "Archives",
        "meaning": "n. 档案，档案室",
        "sentence": "The library archives house historical documents and records, providing a glimpse into the past for those interested in research or exploration."
    },
    {
        "word": "Museum Archives",
        "meaning": "博物馆档案",
        "sentence": "Specialized archives within the library preserve materials related to the museum's history and exhibits."
    },
    {
        "word": "Journal",
        "meaning": "n. ⽇报，杂志",
        "sentence": "Journals, encompassing scholarly articles and research findings, contribute to the academic depth of the library's collection."
    },
    {
        "word": "Current Issue",
        "meaning": "现刊；现期杂志；近期杂志",
        "sentence": "The current issue section ensures that patrons have access to the latest publications, keeping them informed about recent developments."
    },
    {
        "word": "Back Issue",
        "meaning": "过期报刊，过刊",
        "sentence": "Past issues of journals and magazines are available for reference, allowing users to delve into historical perspectives and research."
    },
    {
        "word": "Volume",
        "meaning": "n. (⼀套书中的)⼀卷，⼀册，⼀本",
        "sentence": "Volumes in the library represent individual books or sections within a larger series, offering comprehensive coverage of specific subjects."
    },
    {
        "word": "Bound Volume",
        "meaning": "合订本",
        "sentence": "Bound volumes provide a consolidated format for preserving and accessing multiple issues or parts of a publication in one book."
    },
    {
        "word": "Microform",
        "meaning": "n. 缩微印刷品",
        "sentence": "Microforms, such as microfilm or microfiche, offer compact versions of documents, aiding in space-efficient storage and preservation."
    },
    {
        "word": "Newspaper",
        "meaning": "n. 报纸",
        "sentence": "Newspapers, available in the library, keep readers informed about current events, offering a snapshot of local, national, and global news."
    },
    {
        "word": "Periodical",
        "meaning": "n. 期刊；杂志",
        "sentence": "Periodicals, including magazines and journals, contribute to the library's diverse collection, providing ongoing insights into various fields of interest."
    },
    {
        "word": "Magazine",
        "meaning": "n. 杂 志",
        "sentence": "The library's magazine section covers a wide range of topics, catering to diverse interests and offering readers an engaging and varied reading experience."
    }
]