[
    {
        "word": "primary school",
        "meaning": "小学",
        "sentence": "Primary school is the foundational stage of education, providing students with essential skills and knowledge in a diverse range of subjects."
    },
    {
        "word": "secondary school",
        "meaning": "中学",
        "sentence": "Secondary school follows primary education and typically includes middle and high school, offering more specialized subjects and preparing students for higher education."
    },
    {
        "word": "private school",
        "meaning": "私立学校",
        "sentence": "Private schools operate independently and are funded through tuition fees rather than government funding, often offering unique educational approaches and programs."
    },
    {
        "word": "coeducation",
        "meaning": "男女混校的教育制度",
        "sentence": "Coeducation refers to an educational system where both male and female students are taught together in the same institution, promoting gender equality."
    },
    {
        "word": "preparatory year",
        "meaning": "预科",
        "sentence": "A preparatory year, also known as a foundation year, helps students transition to university-level studies by offering foundational courses and academic support."
    },
    {
        "word": "university",
        "meaning": "n. 大学；综合性大学",
        "sentence": "A university is an institution of higher education that offers undergraduate and postgraduate programs, conducting research and providing a diverse academic environment."
    },
    {
        "word": "college",
        "meaning": "n. 大学",
        "sentence": "In some regions, the term \"college\" is used interchangeably with \"university\" to refer to institutions offering higher education and degree programs."
    },
    {
        "word": "freshman",
        "meaning": "n. 大学—年级学生，新生",
        "sentence": "A freshman is a first-year university student, embarking on their initial academic journey after completing secondary education."
    },
    {
        "word": "sophomore",
        "meaning": "n. 大学二年级生",
        "sentence": "A sophomore is a second-year university student who has gained some experience and familiarity with the academic environment."
    },
    {
        "word": "junior",
        "meaning": "n. 大学三年级学生",
        "sentence": "A junior is a third-year university student, progressing further in their chosen field of study."
    },
    {
        "word": "senior",
        "meaning": "n. 大学四年级学生",
        "sentence": "A senior is a fourth-year university student, often focused on advanced coursework and preparing for graduation."
    },
    {
        "word": "undergraduate",
        "meaning": "n. 大学生；大学肄业生",
        "sentence": "An undergraduate is a student pursuing their first degree, such as a Bachelor's degree, before advancing to postgraduate studies."
    },
    {
        "word": "postgraduate",
        "meaning": "n. 研究生",
        "sentence": "A postgraduate student has completed their undergraduate studies and is pursuing advanced degrees, such as a Master's or Doctorate."
    },
    {
        "word": "international students",
        "meaning": "国际学生",
        "sentence": "International students come from foreign countries to study at an educational institution, contributing to cultural diversity and global perspectives."
    },
    {
        "word": "Bachelor",
        "meaning": "n. 学士学位；大学本科学位证书",
        "sentence": "A Bachelor's degree is an undergraduate academic degree awarded upon the completion of a specific course of study at the university level."
    },
    {
        "word": "Master",
        "meaning": "n. 硕士",
        "sentence": "A Master's degree is a postgraduate academic degree awarded to individuals who have demonstrated advanced knowledge and expertise in a specific field."
    },
    {
        "word": "Doctor",
        "meaning": "n. 博士",
        "sentence": "A Doctorate, or Ph.D., is the highest academic degree awarded by universities, recognizing significant contributions to knowledge through original research."
    },
    {
        "word": "alumni",
        "meaning": "n.（统称）校友，毕业生",
        "sentence": "Alumni are individuals who have graduated from an educational institution, forming a collective network of former students."
    },
    {
        "word": "enrollment",
        "meaning": "n. 登记，注册",
        "sentence": "Enrollment is the process of registering students for courses or programs offered by an educational institution."
    },
    {
        "word": "opening ceremony",
        "meaning": "开学典礼；开幕式",
        "sentence": "The opening ceremony marks the beginning of the academic year or a specific event, bringing together students, faculty, and staff to celebrate the commencement of activities."
    },
    {
        "word": "graduation ceremony",
        "meaning": "毕业典礼",
        "sentence": "The graduation ceremony is a formal event recognizing and celebrating the academic achievements of students who have successfully completed their studies."
    }
]