[
    {
        "word": "campus",
        "meaning": "n. 大学校园",
        "sentence": "The campus is a sprawling area that houses academic buildings, student facilities, and green spaces, creating a vibrant and inclusive university environment."
    },
    {
        "word": "reception",
        "meaning": "n. 接待；接收",
        "sentence": "The reception area serves as the welcoming point for visitors, providing information and assistance with inquiries."
    },
    {
        "word": "admissions office",
        "meaning": "招生办公室",
        "sentence": "The admissions office manages the enrollment process, assisting prospective students with applications and providing information about academic programs."
    },
    {
        "word": "administration office",
        "meaning": "行政办公室",
        "sentence": "The administration office handles administrative tasks, supporting the efficient operation of the university and addressing various organizational needs."
    },
    {
        "word": "society",
        "meaning": "n. 社会；社团",
        "sentence": "Societies on campus offer students opportunities to engage in shared interests, fostering a sense of community and collaboration."
    },
    {
        "word": "student union building",
        "meaning": "学生会大楼",
        "sentence": "The student union building is a hub for student activities, housing meeting spaces, recreational areas, and administrative offices for student government."
    },
    {
        "word": "career centre",
        "meaning": "人才交流；就业中心",
        "sentence": "The career centre provides resources and services to help students explore career paths, find internships, and connect with potential employers."
    },
    {
        "word": "sports centre",
        "meaning": "体育运动中心，运动场",
        "sentence": "The sports centre encompasses facilities for various athletic activities, promoting physical fitness and offering spaces for organized sports events."
    },
    {
        "word": "fitness centre",
        "meaning": "健身中心",
        "sentence": "The fitness centre is equipped with exercise machines and offers fitness classes, promoting a healthy lifestyle for students and staff."
    },
    {
        "word": "security/safety centre",
        "meaning": "安全中心",
        "sentence": "The security/safety centre ensures the well-being of the campus community, providing assistance in emergencies and maintaining a secure environment."
    },
    {
        "word": "student services centre",
        "meaning": "学生服务中心",
        "sentence": "The student services centre offers a range of support services, including academic advising, counseling, and assistance with student-related matters."
    },
    {
        "word": "auditorium",
        "meaning": "n. 礼堂，会堂",
        "sentence": "The auditorium is a venue for lectures, presentations, and cultural events, providing a space for large gatherings within the university."
    },
    {
        "word": "venue",
        "meaning": "n. 审判地；发生地点",
        "sentence": "A venue is a location for hosting events, such as conferences, performances, or ceremonies, contributing to the diversity of campus activities."
    },
    {
        "word": "entrance",
        "meaning": "n. 入口；进入",
        "sentence": "The entrance serves as the main access point to the campus, creating a welcoming and accessible gateway for students, faculty, and visitors."
    },
    {
        "word": "exit",
        "meaning": "n. 出口，通道",
        "sentence": "The exit provides a designated way to leave a building or area, ensuring a safe and organized flow of people."
    },
    {
        "word": "department/faculty building",
        "meaning": "系大楼；院大楼",
        "sentence": "Department/faculty buildings house academic offices, classrooms, and laboratories, serving as dedicated spaces for specific disciplines."
    },
    {
        "word": "canteen",
        "meaning": "n. 食堂，小卖部",
        "sentence": "The canteen offers a variety of food options for students and faculty, providing a convenient place for meals and socializing."
    },
    {
        "word": "dining hall",
        "meaning": "n. 餐厅，食堂",
        "sentence": "The dining hall is a larger eating area that accommodates a larger number of students, offering a communal space for meals."
    },
    {
        "word": "cafeteria",
        "meaning": "n. 自助餐厅",
        "sentence": "The cafeteria provides a self-service dining experience, allowing students to choose from a range of food options."
    },
    {
        "word": "restaurant",
        "meaning": "n. 餐馆； [经] 饭店",
        "sentence": "On-campus restaurants offer a diverse culinary experience, providing a range of cuisines and dining atmospheres."
    },
    {
        "word": "common room",
        "meaning": "公共休息室",
        "sentence": "Common rooms serve as shared spaces for relaxation and informal gatherings, fostering a sense of community among students."
    },
    {
        "word": "gym",
        "meaning": "n. 健身房；体育馆",
        "sentence": "The gym is a facility equipped for physical exercise, promoting health and well-being through various fitness activities."
    },
    {
        "word": "fitness club",
        "meaning": "健身俱乐部",
        "sentence": "The fitness club offers specialized fitness programs and classes, catering to the diverse exercise preferences of the university community."
    },
    {
        "word": "treadmill",
        "meaning": "n. 跑步机",
        "sentence": "Treadmills provide a convenient indoor option for running or walking, supporting cardiovascular fitness in the gym."
    },
    {
        "word": "laboratory",
        "meaning": "n. 实验室",
        "sentence": "Laboratories are equipped spaces where students engage in practical experiments and research activities, applying theoretical knowledge."
    },
    {
        "word": "lecture theatre",
        "meaning": "大教室；阶梯教室",
        "sentence": "The lecture theatre is a large classroom with tiered seating, facilitating lectures and presentations for a larger audience."
    },
    {
        "word": "locker room",
        "meaning": "（学校、体育馆等设有锁柜的）更衣室；衣物间",
        "sentence": "The locker room provides a space for students to store personal belongings and change clothes, commonly used in sports and recreation facilities."
    },
    {
        "word": "recreation centre",
        "meaning": "娱乐中心",
        "sentence": "The recreation centre offers spaces and activities for leisure and entertainment, enhancing the overall campus experience."
    }
]