[
    {
        "word": "identification",
        "meaning": "n. 鉴定；身份证明",
        "sentence": "The process of identification involves confirming or recognizing someone's identity through various means."
    },
    {
        "word": "identity card",
        "meaning": "身份证",
        "sentence": "Carrying an identity card is essential for proving one's identity in various situations, such as official transactions or security checks."
    },
    {
        "word": "student ID card",
        "meaning": "学生卡",
        "sentence": "A student ID card serves as proof of a student's enrollment and is often required for access to university facilities and student discounts."
    },
    {
        "word": "passport",
        "meaning": "n. 护照，通行证",
        "sentence": "A passport is an official government document that certifies a person's identity and citizenship, allowing international travel."
    },
    {
        "word": "photograph",
        "meaning": "n. 照片，相片",
        "sentence": "A photograph is a visual representation captured through a camera, commonly used on identification documents for recognition."
    },
    {
        "word": "visa",
        "meaning": "n. 签证",
        "sentence": "A visa is an endorsement on a passport, indicating permission to enter, leave, or stay in a specific country for a specified period."
    },
    {
        "word": "embassy",
        "meaning": "n. 大使馆；大使馆全体人员",
        "sentence": "An embassy is the official residence and workplace of an ambassador and embassy staff, representing a country in a foreign nation."
    },
    {
        "word": "ambassador",
        "meaning": "n. 大使；代表",
        "sentence": "An ambassador is a diplomatic representative appointed by a government to promote and protect its interests in a foreign country."
    },
    {
        "word": "documentation",
        "meaning": "n. 文件 , 证明文件",
        "sentence": "Documentation refers to the collection of documents providing evidence or information, often used for record-keeping or verification."
    },
    {
        "word": "driving license",
        "meaning": "驾照",
        "sentence": "A driving license is an official document permitting an individual to drive a vehicle legally."
    },
    {
        "word": "permit",
        "meaning": "n. 许可证，执照",
        "sentence": "A permit is an official document granting authorization or approval for a specific activity, often subject to certain conditions."
    },
    {
        "word": "work permit",
        "meaning": "工作许可证",
        "sentence": "A work permit is a document allowing a foreign national to legally work in a specific country for a designated period."
    },
    {
        "word": "extension",
        "meaning": "n. 延长；延期",
        "sentence": "An extension involves prolonging the duration of a document, visa, or permit, granting additional time beyond the original expiration date."
    }
]