[
    {
        "word": "staff",
        "meaning": "n. 职员；工作人员",
        "sentence": "The staff members of the university contribute to the efficient functioning of various departments and services."
    },
    {
        "word": "faculty",
        "meaning": "n. 系，科",
        "sentence": "The faculty encompasses the different academic departments or schools within the university, each specializing in specific fields of study."
    },
    {
        "word": "chancellor",
        "meaning": "n.（美国某些大学的）校长；（英国大学的）名誉校长",
        "sentence": "The chancellor, in certain American universities or as an honorary position in British universities, holds a distinguished role in university governance."
    },
    {
        "word": "vice-chancellor",
        "meaning": "n. 大学副校长",
        "sentence": "The vice-chancellor assists the chancellor and often assumes leadership responsibilities in their absence, contributing to the overall administration of the university."
    },
    {
        "word": "president",
        "meaning": "n.校长",
        "sentence": "The president is a key figure in university administration, overseeing academic and administrative affairs and representing the institution externally."
    },
    {
        "word": "dean",
        "meaning": "n. 院长；系主任",
        "sentence": "The dean leads a specific academic unit, such as a college or school, and plays a vital role in shaping academic policies and initiatives."
    },
    {
        "word": "professor",
        "meaning": "n. 教授",
        "sentence": "Professors are esteemed educators and researchers, providing advanced instruction in their respective fields and contributing to academic scholarship."
    },
    {
        "word": "assistant professor",
        "meaning": "n. 助理教授",
        "sentence": "Assistant professors are early-career academics who hold teaching and research positions, working towards establishing their academic careers."
    },
    {
        "word": "associate professor",
        "meaning": "n. 副教授",
        "sentence": "Associate professors have achieved a higher level of academic accomplishment and often take on additional responsibilities in research, teaching, and service."
    },
    {
        "word": "lecturer",
        "meaning": "n. 讲师",
        "sentence": "Lecturers deliver instructional content in various disciplines, focusing primarily on teaching responsibilities and often contributing to academic research."
    },
    {
        "word": "supervisor",
        "meaning": "n. 主管；监督人",
        "sentence": "Supervisors oversee the work of staff or students, providing guidance, support, and ensuring the successful completion of tasks or projects."
    },
    {
        "word": "advisor",
        "meaning": "n. 顾问；指导教师",
        "sentence": "Advisors offer guidance to students regarding academic and career-related matters, assisting them in making informed decisions about their education."
    },
    {
        "word": "tutor",
        "meaning": "n. 导师；家庭教师",
        "sentence": "Tutors provide individualized academic support to students, helping them understand course material and improve their learning outcomes."
    },
    {
        "word": "teaching assistant",
        "meaning": "n. 助教，教学助理",
        "sentence": "Teaching assistants support professors in delivering course content, grading assignments, and assisting students in understanding complex topics."
    },
    {
        "word": "consultant",
        "meaning": "n. 顾问；咨询者",
        "sentence": "Consultants provide expert advice in specific areas, offering valuable insights and recommendations to address challenges or improve processes."
    },
    {
        "word": "coordinator",
        "meaning": "n. 协调员",
        "sentence": "Coordinators manage and organize activities or projects, ensuring effective communication and collaboration among various stakeholders."
    },
    {
        "word": "counsellor",
        "meaning": "n.（夏令营的）辅导员，管理员",
        "sentence": "Counselors in a summer camp setting provide guidance, support, and supervision to campers, ensuring their well-being and positive experience."
    },
    {
        "word": "sponsor",
        "meaning": "n. 赞助者；主办者",
        "sentence": "Sponsors contribute financial support to events, projects, or individuals, playing a crucial role in ensuring their success."
    },
    {
        "word": "allowance",
        "meaning": "n. 津贴，零用钱",
        "sentence": "An allowance is a sum of money provided regularly, often to cover specific expenses or as discretionary spending."
    },
    {
        "word": "make allowance for",
        "meaning": "体谅，考虑到",
        "sentence": "To make allowance for something is to consider and accommodate specific factors or circumstances in decision-making or planning."
    },
    {
        "word": "expert",
        "meaning": "n. 专家；行家",
        "sentence": "An expert is a person with extensive knowledge and skill in a particular field, often sought for advice or guidance."
    },
    {
        "word": "representative",
        "meaning": "n. 代表；典型；众议员",
        "sentence": "A representative is an individual chosen to act on behalf of a group or organization, reflecting their interests or viewpoints."
    },
    {
        "word": "on your behalf",
        "meaning": "代你方；代表你",
        "sentence": "To act on someone's behalf is to represent or make decisions for them, typically when they are unable to do so themselves."
    }
]