[
    {
        "word": "flight",
        "meaning": "n. 飞行；班机",
        "sentence": "Booking a flight allows travelers to experience air travel and reach their destination efficiently."
    },
    {
        "word": "flight number",
        "meaning": "航班；飞机班次",
        "sentence": "A flight number uniquely identifies a specific air route, helping passengers locate and board their flights."
    },
    {
        "word": "reservation",
        "meaning": "n. 预约，预订",
        "sentence": "Making a reservation in advance ensures that travelers have secured their seats or accommodations for their journey."
    },
    {
        "word": "make a reservation/booking",
        "meaning": "n. 预订；预约",
        "sentence": "To guarantee a spot, it is essential to make a reservation or booking for flights, hotels, or other services."
    },
    {
        "word": "vacant seat",
        "meaning": "空位，未被占座位",
        "sentence": "A vacant seat refers to an unoccupied space on a plane, offering flexibility for last-minute travelers."
    },
    {
        "word": "book the ticket",
        "meaning": "订票",
        "sentence": "Passengers can book their tickets online or through travel agencies to secure their place on a flight."
    },
    {
        "word": "passport",
        "meaning": "n. 护照",
        "sentence": "A passport is an essential travel document that verifies a person's identity and nationality."
    },
    {
        "word": "visa",
        "meaning": "n. 签证",
        "sentence": "A visa is an official endorsement on a passport, granting permission to enter or leave a particular country."
    },
    {
        "word": "extension",
        "meaning": "n. 延长；延期",
        "sentence": "If needed, travelers can apply for an extension to prolong the validity of their visa or driving license."
    },
    {
        "word": "driving license",
        "meaning": "驾驶证",
        "sentence": "A driving license is a permit allowing an individual to operate a motor vehicle legally."
    },
    {
        "word": "expire",
        "meaning": "vi. 期满；终止",
        "sentence": "Documents such as visas or licenses expire when they reach the end of their designated period of validity."
    },
    {
        "word": "fee",
        "meaning": "n. 费用；酬金",
        "sentence": "Travelers may encounter various fees associated with booking flights, acquiring visas, or checking baggage."
    },
    {
        "word": "fare",
        "meaning": "旅费；车费；船费；飞机票价",
        "sentence": "The fare represents the cost of transportation, including airfare for flights or fees for other modes of travel."
    },
    {
        "word": "air fare",
        "meaning": "飞机票价",
        "sentence": "Airfare is the price paid for a seat on an airplane, covering the cost of the flight."
    },
    {
        "word": "departure lounge",
        "meaning": "候机室",
        "sentence": "Passengers wait in the departure lounge before boarding, where facilities and services are available."
    },
    {
        "word": "arrival/departure",
        "meaning": "到达/出发",
        "sentence": "Arrival and departure refer to reaching and leaving a particular destination, respectively."
    },
    {
        "word": "check-in",
        "meaning": "在旅馆、机场、大会等处)办理登记手续；记录；报到",
        "sentence": "Passengers check-in before a flight, providing necessary information and receiving boarding passes."
    },
    {
        "word": "baggage",
        "meaning": "n. 行李",
        "sentence": "Baggage includes the personal belongings and luggage that passengers bring on a trip."
    },
    {
        "word": "baggage reclaim",
        "meaning": "行李提取处",
        "sentence": "The baggage reclaim area is where passengers retrieve their checked luggage upon arrival."
    },
    {
        "word": "luggage",
        "meaning": "n. 行李；皮箱",
        "sentence": "Luggage encompasses the bags, suitcases, and containers used to transport personal belongings."
    },
    {
        "word": "boarding pass",
        "meaning": "n. 登机牌",
        "sentence": "A boarding pass is a document that permits a passenger to board a specific flight."
    },
    {
        "word": "customs",
        "meaning": "n. 海关；风俗;",
        "sentence": "Customs involves the inspection and clearance of goods and passengers entering or leaving a country."
    },
    {
        "word": "duty-free shop",
        "meaning": "免税店",
        "sentence": "Duty-free shops allow travelers to purchase goods without paying certain taxes or duties."
    },
    {
        "word": "economy class",
        "meaning": "经济舱",
        "sentence": "Economy class is the standard seating class on an airplane, offering a more affordable travel option."
    },
    {
        "word": "first class",
        "meaning": "[火车、飞机、轮船等的] 头等车厢，头等舱",
        "sentence": "First class provides passengers with premium amenities and seating for a more luxurious travel experience."
    },
    {
        "word": "business class",
        "meaning": "商务舱",
        "sentence": "Business class offers enhanced comfort and services, positioned between economy and first class."
    },
    {
        "word": "destination",
        "meaning": "n. 目的地，终点",
        "sentence": "The destination is the ultimate endpoint or location to which a traveler is headed."
    },
    {
        "word": "Paris",
        "meaning": "巴黎",
        "sentence": "Paris, the capital of France, is renowned for its art, culture, and iconic landmarks."
    },
    {
        "word": "Berlin",
        "meaning": "n. 柏林",
        "sentence": "Berlin, the capital of Germany, boasts a rich history, vibrant arts scene, and modern architecture."
    },
    {
        "word": "Athens",
        "meaning": "n. 雅典 [希腊首都]",
        "sentence": "Athens, the capital of Greece, is known for its historical significance, ancient ruins, and cultural heritage."
    },
    {
        "word": "Sydney",
        "meaning": "n. 悉尼 [澳大利亚港市]",
        "sentence": "Sydney, a major city in Australia, is famous for its stunning harbor, landmarks, and diverse culture."
    },
    {
        "word": "Melbourne",
        "meaning": "n. 墨尔本",
        "sentence": "Melbourne, a city in Australia, is celebrated for its arts, coffee culture, and sports events."
    },
    {
        "word": "York",
        "meaning": "纽约",
        "sentence": "York, often referred to as New York, is a bustling city in the United States known for its diversity and iconic attractions."
    },
    {
        "word": "London",
        "meaning": "伦敦",
        "sentence": "London, the capital of the United Kingdom, is a global city renowned for its history, culture, and landmarks."
    },
    {
        "word": "runway",
        "meaning": "n. 跑道",
        "sentence": "The runway is a designated strip on which aircraft take off and land at airports."
    },
    {
        "word": "terminal",
        "meaning": "美国英语终点站；航站楼；运输线的枢纽站",
        "sentence": "A terminal serves as the endpoint for transportation modes, such as trains, buses, or the main building at an airport."
    },
    {
        "word": "crew",
        "meaning": "n.全体人员，全体船员",
        "sentence": "The crew consists of all personnel, including pilots and flight attendants, responsible for operating an aircraft."
    },
    {
        "word": "pilot",
        "meaning": "n. 飞行员；领航员",
        "sentence": "A pilot is a trained professional responsible for operating and navigating an aircraft."
    },
    {
        "word": "flight attendant",
        "meaning": "n.空中乘务员",
        "sentence": "Flight attendants are cabin crew members responsible for ensuring the safety and comfort of passengers during a flight."
    }
]