[
    {
        "word": "expedition",
        "meaning": "n. 远征;探险队",
        "sentence": "Embarking on an expedition allows adventurers to explore new territories and undertake thrilling journeys."
    },
    {
        "word": "excursion",
        "meaning": "n.远足;短程旅行",
        "sentence": "An excursion offers the opportunity for a short and enjoyable journey, often involving outdoor activities."
    },
    {
        "word": "resort",
        "meaning": "n.度假胜地;常去之地",
        "sentence": "A resort is a popular destination for relaxation and recreation, attracting visitors seeking leisure and entertainment."
    },
    {
        "word": "tour",
        "meaning": "n. 旅游;旅行",
        "sentence": "A tour provides a guided journey to various destinations, offering a curated experience for travelers."
    },
    {
        "word": "tourism",
        "meaning": "n. 旅游业;游览",
        "sentence": "Tourism involves the activities and services related to travel, exploration, and visiting different places."
    },
    {
        "word": "travel agency",
        "meaning": "旅行社",
        "sentence": "A travel agency assists individuals in planning and organizing their trips, providing services such as booking accommodations and transportation."
    },
    {
        "word": "package tour",
        "meaning": "包办旅行",
        "sentence": "A package tour includes pre-arranged travel services, covering accommodation, transportation, and activities for a seamless experience."
    },
    {
        "word": "itinerary",
        "meaning": "n. 旅程;路线;旅行日程",
        "sentence": "An itinerary outlines the planned route and schedule for a journey, ensuring a well-organized travel plan."
    },
    {
        "word": "schedule",
        "meaning": "n. 时间表;计划表",
        "sentence": "A schedule details the timing and sequence of events, helping travelers stay organized during their trips."
    },
    {
        "word": "voyage",
        "meaning": "n. 航行;航程",
        "sentence": "A voyage refers to a long journey, especially one by sea, often associated with exploration or travel between distant places."
    },
    {
        "word": "sunrise",
        "meaning": "n. 日出;黎明",
        "sentence": "Sunrise is the moment when the sun appears above the horizon, marking the beginning of a new day."
    },
    {
        "word": "sunset",
        "meaning": "n. 日落;傍晚",
        "sentence": "Sunset is the time when the sun disappears below the horizon, creating a picturesque view of the evening sky."
    },
    {
        "word": "sunlight",
        "meaning": "n. 日光",
        "sentence": "Sunlight is the natural light emitted by the sun, providing illumination during the day."
    },
    {
        "word": "backpack",
        "meaning": "n. 双肩背包",
        "sentence": "A backpack is a convenient and portable bag worn on the back, ideal for carrying personal belongings during outdoor activities."
    },
    {
        "word": "back-packer",
        "meaning": "背包客",
        "sentence": "A backpacker is an independent traveler who prefers budget-friendly and adventurous journeys, often exploring various destinations."
    },
    {
        "word": "mountain",
        "meaning": "n. 山;山脉",
        "sentence": "Mountains are majestic landforms with significant elevation, offering breathtaking views and diverse ecosystems."
    },
    {
        "word": "mountain bike",
        "meaning": "n. 山地车",
        "sentence": "A mountain bike is specially designed for off-road cycling, making it suitable for adventurous trails and mountainous terrain."
    },
    {
        "word": "desert",
        "meaning": "n. 沙漠;荒原",
        "sentence": "A desert is a barren landscape characterized by sparse vegetation and extreme temperatures, attracting those seeking unique and challenging environments."
    },
    {
        "word": "coast",
        "meaning": "n. 海岸;滑坡",
        "sentence": "The coast is the area where land meets the sea, offering scenic views, beaches, and diverse marine life."
    },
    {
        "word": "Tower of London",
        "meaning": "伦敦塔",
        "sentence": "The Tower of London is a historic castle on the banks of the River Thames, known for its rich history and iconic architecture."
    },
    {
        "word": "Westminster Abbey",
        "meaning": "威斯敏斯特教堂",
        "sentence": "Westminster Abbey is a renowned Gothic church in London, famous for royal weddings, coronations, and its architectural beauty."
    },
    {
        "word": "Sydney Opera House",
        "meaning": "悉尼歌剧院",
        "sentence": "The Sydney Opera House is an iconic performing arts venue in Australia, celebrated for its distinctive architectural design."
    },
    {
        "word": "harbor",
        "meaning": "n. 海港;避难所",
        "sentence": "A harbor is a sheltered area of water where ships anchor, providing safety and facilities for maritime activities."
    },
    {
        "word": "beach",
        "meaning": "n. 海滩",
        "sentence": "A beach is a sandy or pebbly shore along the coastline, offering a popular destination for relaxation and recreation."
    },
    {
        "word": "cliff",
        "meaning": "n. 悬崖;绝壁",
        "sentence": "A cliff is a steep rock face, often found along coastlines or in mountainous regions, creating dramatic landscapes."
    },
    {
        "word": "rainforest",
        "meaning": "n.（热带）⾬林",
        "sentence": "A rainforest is a lush and dense forest characterized by high rainfall, diverse flora and fauna, and a unique ecosystem."
    },
    {
        "word": "walking club",
        "meaning": "竞⾛（步⾏）俱乐部",
        "sentence": "A walking club provides a community for individuals passionate about walking, fostering social connections and promoting physical activity."
    },
    {
        "word": "walking tour",
        "meaning": "徒步旅⾏;远⾜",
        "sentence": "A walking tour involves exploring a destination on foot, allowing participants to appreciate the surroundings at a leisurely pace."
    },
    {
        "word": "walking boots",
        "meaning": "步⾏靴",
        "sentence": "Sturdy and comfortable walking boots are essential footwear for hikers, providing support and protection during long walks."
    },
    {
        "word": "bush walking",
        "meaning": "丛林漫步",
        "sentence": "Bushwalking involves hiking or walking through natural landscapes, such as forests or bush areas, offering a close connection with nature."
    },
    {
        "word": "humid",
        "meaning": "adj. 潮湿的;湿润的",
        "sentence": "Humid conditions are characterized by high moisture levels in the air, creating a damp or wet atmosphere."
    },
    {
        "word": "ﬁshing boat",
        "meaning": "渔船",
        "sentence": "A fishing boat is a vessel used for catching fish, equipped with gear and facilities for fishing activities."
    },
    {
        "word": "vineyard",
        "meaning": "n. 葡萄园",
        "sentence": "A vineyard is an agricultural area where grapes are cultivated, often for wine production."
    },
    {
        "word": "go camping",
        "meaning": "去野营",
        "sentence": "Going camping involves setting up temporary shelters outdoors, providing a unique and immersive experience in nature."
    },
    {
        "word": "wildlife zoo",
        "meaning": "野生动物园",
        "sentence": "A wildlife zoo showcases a variety of animals in naturalistic habitats, offering educational and conservation-focused experiences."
    },
    {
        "word": "national park",
        "meaning": "（美）国家公园",
        "sentence": "A national park is a protected area with significant natural, cultural, or recreational value, open for public enjoyment."
    },
    {
        "word": "picnic",
        "meaning": "n. 野餐",
        "sentence": "A picnic is an outdoor meal enjoyed in a scenic location, often involving food, drinks, and recreational activities."
    },
    {
        "word": "heritage",
        "meaning": "n. 遗产;传统",
        "sentence": "Heritage refers to cultural, historical, or natural assets passed down through generations, contributing to a sense of identity and continuity."
    },
    {
        "word": "wheelchair",
        "meaning": "n. 轮椅",
        "sentence": "A wheelchair is a mobility aid with wheels, providing support and independence for individuals with mobility challenges."
    },
    {
        "word": "platform",
        "meaning": "n. 平台;站台",
        "sentence": "A platform is a raised surface, such as a train or bus platform, serving as a waiting area or departure point."
    },
    {
        "word": "museum",
        "meaning": "博物馆",
        "sentence": "A museum is an institution that preserves and exhibits objects of cultural, historical, scientific, or artistic significance."
    },
    {
        "word": "art gallery",
        "meaning": "[建] 美术馆;画廊",
        "sentence": "An art gallery is a space for displaying and showcasing visual art, providing a venue for artistic appreciation."
    },
    {
        "word": "souvenir",
        "meaning": "纪念品",
        "sentence": "A souvenir is a memento or keepsake purchased as a reminder of a specific place or experience."
    },
    {
        "word": "castle",
        "meaning": "n. 城堡",
        "sentence": "A castle is a fortified building with historical and architectural significance, often associated with medieval times."
    },
    {
        "word": "ancient temple",
        "meaning": "古庙",
        "sentence": "An ancient temple is a religious or sacred structure from historical times, showcasing architectural and cultural heritage."
    },
    {
        "word": "cathedral",
        "meaning": "n. ⼤教堂",
        "sentence": "A cathedral is a large and important church, often the seat of a bishop, known for its grand architecture and religious significance."
    },
    {
        "word": "aquarium",
        "meaning": "n. ⽔族馆;养⻥池",
        "sentence": "An aquarium is a facility that displays marine life in tanks, offering educational and entertaining experiences."
    },
    {
        "word": "botanical garden",
        "meaning": "植物园",
        "sentence": "A botanical garden features a collection of plants for scientific, educational, and conservation purposes."
    },
    {
        "word": "City Council",
        "meaning": "市(参)议会",
        "sentence": "A City Council is a local governing body responsible for municipal affairs and decision-making."
    },
    {
        "word": "City Hall",
        "meaning": "市政厅",
        "sentence": "City Hall is a central administrative building where local government offices and services are located."
    },
    {
        "word": "amusement park",
        "meaning": "游乐园",
        "sentence": "An amusement park provides entertainment through a variety of rides, attractions, and activities for visitors of all ages."
    },
    {
        "word": "organic farm",
        "meaning": "有机农场",
        "sentence": "An organic farm emphasizes natural and sustainable farming practices, avoiding synthetic pesticides and fertilizers."
    },
    {
        "word": "valley",
        "meaning": "n. ⼭⾕;流域",
        "sentence": "A valley is a low area of land between hills or mountains, often traversed by a river, providing picturesque landscapes."
    },
    {
        "word": "waterfall",
        "meaning": "n. 瀑布",
        "sentence": "A waterfall is a natural feature where water cascades over a vertical drop, creating a stunning and dynamic display."
    },
    {
        "word": "hot spring",
        "meaning": "温泉",
        "sentence": "A hot spring is a natural water source heated by geothermal activity, offering relaxation and potential health benefits."
    },
    {
        "word": "palace",
        "meaning": "n. 宫殿;宅邸",
        "sentence": "A palace is a grand and ornate residence, historically associated with royalty or important figures."
    },
    {
        "word": "look-out point",
        "meaning": "眺望点",
        "sentence": "A look-out point provides elevated views of the surrounding landscape, offering panoramic perspectives."
    },
    {
        "word": "exhibition",
        "meaning": "n. 展览;展览会",
        "sentence": "An exhibition showcases objects, art, or information for public viewing, often organized around a specific theme or topic."
    },
    {
        "word": "sculpture",
        "meaning": "n. 雕塑;雕刻",
        "sentence": "A sculpture is a three-dimensional artwork created by shaping or carving materials such as stone, metal, or wood."
    },
    {
        "word": "shopping centre",
        "meaning": "购物中⼼",
        "sentence": "A shopping center is a complex with various retail stores and services, providing a one-stop destination for shopping."
    },
    {
        "word": "department store",
        "meaning": "百货公司",
        "sentence": "A department store offers a wide range of products across different categories, catering to various consumer needs."
    },
    {
        "word": "cable car ",
        "meaning": "（美）缆⻋",
        "sentence": "A cable car is a form of transportation using suspended cables for movement, often found in mountainous or urban areas."
    },
    {
        "word": "clubhouse",
        "meaning": "n. 俱乐部会所;俱乐部",
        "sentence": "A clubhouse is a facility used by a club or group for social and recreational activities."
    },
    {
        "word": "notice board",
        "meaning": "布告牌;警告牌",
        "sentence": "A notice board displays information, announcements, or warnings, serving as a public communication tool."
    }
]