[
    {
        "word": "sleeping bag",
        "meaning": "睡袋",
        "sentence": "A cozy sleeping bag is essential for a comfortable night's rest during camping trips or outdoor adventures."
    },
    {
        "word": "camping",
        "meaning": "n. 露营",
        "sentence": "Camping provides an opportunity to connect with nature and enjoy outdoor activities in a natural environment."
    },
    {
        "word": "luggage",
        "meaning": "n. 行李;⽪箱",
        "sentence": "When traveling, it's crucial to pack essentials in durable luggage, ensuring convenience and ease during the journey."
    },
    {
        "word": "tent",
        "meaning": "n. 帐篷;住处",
        "sentence": "A sturdy tent serves as a temporary shelter, providing comfort and protection during camping expeditions."
    },
    {
        "word": "flashlight",
        "meaning": "n. ⼿电筒",
        "sentence": "A reliable flashlight is a handy tool for illuminating the surroundings during outdoor activities or emergencies."
    },
    {
        "word": "hiking boots",
        "meaning": "徒步旅⾏靴;登⼭鞋",
        "sentence": "Comfortable and durable hiking boots offer support and protection for feet during extended outdoor walks or hikes."
    },
    {
        "word": "sock",
        "meaning": "n. 短袜",
        "sentence": "Wearing comfortable socks is essential for foot hygiene and preventing discomfort during outdoor activities."
    },
    {
        "word": "compass",
        "meaning": "n. 指南针;罗盘",
        "sentence": "A compass is a valuable navigation tool for hikers and campers, providing directional guidance in unfamiliar terrain."
    },
    {
        "word": "helmet",
        "meaning": "n. 钢盔;头盔",
        "sentence": "Wearing a helmet ensures safety during activities such as biking, climbing, or other sports that pose a risk of head injury."
    },
    {
        "word": "torch",
        "meaning": "n. ⽕把;⽕炬",
        "sentence": "A torch is a portable source of light, useful for navigating in the dark during outdoor adventures."
    },
    {
        "word": "mosquito net",
        "meaning": "n. 蚊帐",
        "sentence": "A mosquito net offers protection against mosquitoes and other insects, ensuring a peaceful night's sleep."
    },
    {
        "word": "repellent",
        "meaning": "n. 防护剂;驱⾍剂",
        "sentence": "Insect repellent helps ward off mosquitoes and other bugs, preventing insect bites during outdoor activities."
    },
    {
        "word": "sunblock",
        "meaning": "n. 防晒霜",
        "sentence": "Sunblock protects the skin from harmful UV rays, preventing sunburn during outdoor excursions."
    },
    {
        "word": "sunscreen",
        "meaning": "n. 防晒油中的;遮光剂",
        "sentence": "Sunscreen shields the skin from sun exposure, reducing the risk of sunburn and long-term damage."
    },
    {
        "word": "sun cream",
        "meaning": "防晒霜",
        "sentence": "Applying sun cream is crucial for safeguarding the skin against the sun's harmful effects during outdoor activities."
    },
    {
        "word": "suntan lotion",
        "meaning": "防晒油",
        "sentence": "Suntan lotion not only protects against sunburn but also helps achieve a gradual, even tan."
    },
    {
        "word": "lotion",
        "meaning": "n. 涂剂;搽剂;润肤霜",
        "sentence": "Lotion, such as body lotion, provides moisturization and nourishment to the skin, keeping it hydrated."
    },
    {
        "word": "tan",
        "meaning": "n. 日晒后皮肤的;黝黑色;棕褐色",
        "sentence": "A tan results from exposure to the sun, creating a darkened or bronzed shade on the skin."
    },
    {
        "word": "road map",
        "meaning": "驾驶员用的;公路线路图",
        "sentence": "A road map assists drivers in navigating routes and reaching destinations efficiently during road trips."
    },
    {
        "word": "swimming trunks",
        "meaning": "男式游泳裤",
        "sentence": "Swimming trunks are essential swimwear for men, providing comfort and ease of movement in the water."
    },
    {
        "word": "swimming costume",
        "meaning": "游泳衣",
        "sentence": "A swimming costume, suitable for both men and women, is ideal swimwear for various water activities."
    },
    {
        "word": "sunglasses",
        "meaning": "n. 太阳镜",
        "sentence": "Sunglasses protect the eyes from harmful UV rays and reduce glare, enhancing visibility in bright sunlight."
    },
    {
        "word": "sandglass",
        "meaning": "n. 沙漏;用于计算时间",
        "sentence": "A sandglass is a timekeeping device that uses sand to measure intervals, often used for short-duration activities."
    },
    {
        "word": "beach towel",
        "meaning": "沙滩浴巾",
        "sentence": "A beach towel is a large, absorbent towel used for drying off after swimming or lounging on the beach."
    },
    {
        "word": "battery",
        "meaning": "n. [电] 电池;蓄电池",
        "sentence": "Batteries power various electronic devices, making them essential for outdoor gadgets and equipment."
    },
    {
        "word": "bottled water",
        "meaning": "瓶装水",
        "sentence": "Carrying bottled water ensures hydration during outdoor activities, providing a convenient and portable water source."
    },
    {
        "word": "camera",
        "meaning": "n. 照相机;摄影机",
        "sentence": "A camera captures memorable moments during outdoor adventures, allowing individuals to document their experiences."
    },
    {
        "word": "first-aid kit",
        "meaning": "急救箱",
        "sentence": "A first-aid kit contains essential medical supplies to address minor injuries or health concerns during outdoor activities."
    },
    {
        "word": "medicine",
        "meaning": "n. 药;医学",
        "sentence": "Carrying necessary medicines ensures preparedness for common health issues or emergencies during travel."
    },
    {
        "word": "aspirin",
        "meaning": "n. 阿司匹林;解热镇痛药",
        "sentence": "Aspirin, a common pain reliever, is useful for alleviating discomfort and reducing fever during outdoor excursions."
    },
    {
        "word": "cold cure",
        "meaning": "感冒药",
        "sentence": "Cold cure medications provide relief from symptoms of the common cold, helping individuals recover more quickly."
    },
    {
        "word": "antibiotics",
        "meaning": "n. [药] 抗生素",
        "sentence": "Antibiotics are medications used to treat bacterial infections and are valuable additions to a first-aid kit."
    },
    {
        "word": "bandage",
        "meaning": "n. 绷带",
        "sentence": "Bandages are essential for covering wounds and providing support for injured areas, promoting healing."
    },
    {
        "word": "gas",
        "meaning": "n. 气体;[矿业] 瓦斯",
        "sentence": "Gas, such as propane, is commonly used for cooking or heating while camping or in outdoor settings."
    },
    {
        "word": "petrol",
        "meaning": "n.（英）汽油",
        "sentence": "Petrol, also known as gasoline, fuels vehicles and equipment with internal combustion engines."
    },
    {
        "word": "guidebook",
        "meaning": "n. 旅行指南;指导手册",
        "sentence": "A guidebook offers valuable information about destinations, attractions, and practical tips for travelers."
    },
    {
        "word": "handbook",
        "meaning": "n. 手册;指南",
        "sentence": "A handbook provides detailed information and instructions on a particular subject, serving as a helpful reference."
    },
    {
        "word": "brochure",
        "meaning": "n. 手册;小册子",
        "sentence": "A brochure is a compact printed document containing information about a product, service, or destination."
    },
    {
        "word": "booklet",
        "meaning": "n. 小册子",
        "sentence": "A booklet is a small, bound publication that provides information on a specific topic."
    },
    {
        "word": "pamphlet",
        "meaning": "n. 小册子",
        "sentence": "A pamphlet is a brief, unbound publication containing information or opinions on a particular subject."
    },
    {
        "word": "leaﬂet",
        "meaning": "n. 小叶;传单",
        "sentence": "A leaﬂet is a single sheet of printed material, often used for informational or promotional purposes."
    },
    {
        "word": "luggage",
        "meaning": "n. 行李;皮箱",
        "sentence": "Luggage includes suitcases and bags used for transporting personal belongings during travel."
    },
    {
        "word": "suitcase",
        "meaning": "n. [轻] 手提箱;衣箱",
        "sentence": "A suitcase is a portable case with a handle, typically used for carrying clothes and personal items."
    },
    {
        "word": "nylon",
        "meaning": "n. 尼龙",
        "sentence": "Nylon is a synthetic material known for its durability and versatility, commonly used in the manufacturing of various products."
    },
    {
        "word": "parcel",
        "meaning": "n. 包裹",
        "sentence": "A parcel is a package or bundle of items wrapped and sent for delivery."
    },
    {
        "word": "purse",
        "meaning": "n. (女士)钱包",
        "sentence": "A purse is a small bag for carrying money, cards, and personal items, typically used by women."
    },
    {
        "word": "stopwatch",
        "meaning": "n. 码表;跑表",
        "sentence": "A stopwatch measures elapsed time with precision, making it useful for tracking performance in sports or other activities."
    }
]